//
//  ToDoView.swift
//  A33ToDo
//
//  Created by Davit Natenadze on 08.12.23.
//

import SwiftUI


/*
 ტექსტურად აჩვენეთ რამდენი დავალება დარჩა შესასრულებელი
 პროფილის ფოტოზე აჩვენეთ შესასრულებელი დავალებების რაოდენობა
 პროგრესის მაჩვენებელი ვიუ Optional არის
 complete all შეასრულებს ყველა ტასკს
 სიაში ზემოთ იყოს შესრულებულები
 ქვემოთ შესასრულებლები .
 შესაძლებელი იყოს შესრულებულის განიშვნაც.
 გამოიყენეთ 2 @State მასივი და ყველაფერი ვიუს ფაილშივე გქონდეთ, ViewModel კომუნიკაციები არ გინდათ.
  
 - Optional
 აპლიკაციაში იყოს 2 სექცია შესრულებულების და შესასრულებელი დავალებების ცალკე სექციებად (ეს გასარჩევი გექნებათ როგორ უნდა გაკეთდეს)
 პლიუს ერთი ზემოთ უკვე ვთქვი: - პროგრესის მაჩვენებელი ვიუ
 */


struct ToDoView: View {
    
    // MARK: - Properties
    
    // MARK: - Body
    var body: some View {
        Text("Hello, World!")
    }
    
}

// MARK: - Preview
#Preview {
    ToDoView()
}
